#include<stdio.h> 
#include<stdlib.h> 
int main(void){
	printf("\n|--------------個人風格的畫面--------------|");
	printf("\n|------------------------------------------|");
	printf("\n|--------------   -------------------------|");
	printf("\n|--------------   ----------------   ------|");
	printf("\n|--------------   --------------     ------|");
	printf("\n|--------------         --------   --------|");
	printf("\n|-------          ------------  -----------|");
	printf("\n|--------------   ----------  -------------|");
	printf("\n|-----------        -----------------------|");
	printf("\n|-------------------------------     ------|");
	printf("\n|---------------       ---------    -------|");
	printf("\n|---------   -----     -------   ----------|");
	printf("\n|---------   ---    --------   -----   ----|");
	printf("\n|-----------   ---   -------------     ----|");
	printf("\n|---------   -----   -------------   ------|");
	printf("\n|----------   --   -------------   --------|");
	printf("\n|-------------        --------  -----------|");
	printf("\n|-----        --------------  -------------|");
	printf("\n|-----------------------    ---------------|");
	printf("\n|---------------------  -------------------|");
	printf("\n|---------------E1B16彭宏瑜----------------|");
	printf("\n|------------------------------------------|");
	printf("\n|--------------按下任意鍵繼續--------------|");
	system("pause");
	system("CLS");
	
	char key[5];
	int wrong=0; /*宣告字串key存儲輸入的密碼，變數wrong紀錄輸入錯誤次數*/
	printf("請輸入密碼(密碼是2025)：");
	do{
		scanf("%s",key);
		if(key[0]=='2'&&key[1]=='0'&&key[2]=='2'&&key[3]=='5'&&key[4]=='\0'){
		fflush(stdin);
		system("CLS");
		break ; } 
		else{
		wrong++;
		fflush(stdin);
		printf("已輸入錯誤%d次，錯誤三次就再見\n",wrong);
		if(wrong==3){
		printf("掰掰");return 0;}}		
	}while(wrong<3);
	/*若輸入key為2025，跳出if執行下一步；不為則wrong值+1，超過三次結束程式*/
	
	manu:/*此處標記以便之後goto的使用*/
	printf("\n|--------------------------------------|");
	printf("\n|           a.畫出直角三角形           |");
	printf("\n|--------------------------------------|");
	printf("\n|             b.顯示乘法表             |");
	printf("\n|--------------------------------------|");
	printf("\n|                c.結束                |");
	printf("\n|--------------------------------------|\n");
	printf("\n         請輸入A或a,B或b以繼續 ：       \n");
	
	int letter,i,j,k;
	char manu_key[2],tri[2];
	scanf("%s",manu_key);
	if(manu_key[1]=='\0'&&manu_key[0]=='a'||manu_key[1]=='\0'&&manu_key[0]=='A') { /*若輸入值c1為A或a，清空螢幕並要求輸入字元*/
		system("CLS");
		ask1:/*此處標記以便之後goto的使用*/
		printf("輸入一個a~n的字元(僅限小寫)：");
		scanf("%s",tri);
		letter=tri[0];/*將a2設為輸入字元c2的ascii code*/
		if(tri[0]>='a'&&tri[0]<='n'&&tri[1]=='\0'){ /*若輸入的字元c2介於a~n之間，執行下面for迴圈產生直角三角形*/
		printf("\n");
		for(i=letter-'a';i>=0;i--){/*i用來計算所需的列數(輸出\n)，因為輸入值介於a~n，
		因此將i起始值設為輸入值減去'a'，只要i大於等於0，i--，並輸出\n*/
			for(k=i;k>0;k--){/*k用來計算空格的輸出量，只要i大於0，k--並輸出一個空格*/
				printf(" ");
			}
			for(j=i;j<=letter-'a';j++){/*j用來輸出字符，又因為要呈現出直角三角形，放在k的下方，
			                        j初始值根據i值，若i小於等於a2-'a'，j++並輸出字符j+'a' */
				printf("%c",j+'a');
			}
			printf("\n");
		}
		fflush(stdin);
		system("pause");
		system("CLS");
		goto manu; /*程式停止，按任意鍵回到選單*/
		}else{
		printf("請重新");
		fflush(stdin);
		goto ask1;}/*輸入錯誤，反回重新輸入字元*/
	}

	if(manu_key[1]=='\0'&&manu_key[0]=='b'||manu_key[1]=='\0'&&manu_key[0]=='B') {/*若輸入值c1為B或b，清空螢幕並要求輸入整數1~9*/
		int i1,j1,num1;
		char num[2];
		system("CLS");
		fflush(stdin);
		ask2:/*此處標記以便之後goto的使用*/
		printf("輸入一個1~9的整數：");
		scanf("%s", num); 
		if(num[0]>='1'&&num[0]<='9'&&num[1]=='\0'){/*若輸入字符介於1~9，印出乘法表*/
		num1=num[0]-'0';/*num1=num[0]-'0';/*num1值為num第一個字元的ascii code減去0的ascii code*/
		printf("1*1~%d*%d的乘法表如下:\n",num1,num1);
		for(i1=1;i1<=num1;i1++){/*i值由1開始，+至輸入的整數p1停止*/
			for(j1=1;j1<=num1;j1++){/*j由1開始，同樣+至輸入的整數p1停止*/
				printf("%d*%d=%d  ",i1,j1,i1*j1)	;
			}
			printf(" \n"); 
		}
		system("pause");
		system("CLS");
		goto manu; /*程式停止，按任意鍵回到選單*/
	}else{
	system("CLS");
	printf("請重新");
	fflush(stdin); 
	goto ask2;}/*輸入錯誤，反回重新輸入字元*/
	}
	
	char opt3[2];
	if(manu_key[1]=='\0'&&manu_key[0]=='c'||manu_key[1]=='\0'&&manu_key[0]=='C') {
	printf("\'Continue？(y/n)\'");
	ask3:/*此處標記以便之後goto的使用*/
	printf("\n若要回到選單，請按Y或y");
	printf("\n若要結束程式，請按N或n");
	printf("：\n");
	fflush(stdin);
	scanf("%s",opt3);
	if(opt3[1]=='\0'&&opt3[0]=='Y'||opt3[1]=='\0'&&opt3[0]=='y'){
	system("CLS");
	fflush(stdin);
	goto manu;/*輸入Y或y，回到選單*/
	}
	else if(opt3[1]=='\0'&&opt3[0]=='N'||opt3[1]=='\0'&&opt3[0]=='n'){
		return 0;/*輸入N或n，程式結束*/
	}
	else{
		system("CLS");
		printf("輸入錯誤，");
		goto ask3 ;/*輸入字元非Y,y或N,n，反回重新輸入字元*/
	}
}
	else{
		system("CLS");
		goto manu;
	}
	return 0;
}
/*這次作業我遇到的第一個難點就是字母的三角形，一開始以為用兩個變數分別對應列數和列印字母，
  做完才發現還要多一個變數來列印空格才能形成範例上的三角形， 
  而且因為這個三角形的字母順序是倒著列印的(cba)，一開始在設定i跟k要怎麼取值時想了很久，
  過程也發現a2-97可以用a2-'a'替換，而且更方便理解。整個三角形的功能就耗了快一小時。
  
  第二個難點是我在做測試時發現，一開始輸入密碼的部分，如果我輸入了英文字母，螢幕就會突然關閉，
  所以我試著用字串代替整數輸入，預期達到不論怎麼輸入都能正常運行的效果， 
  但也因為之前沒有使用字串的經驗，很多地方都不熟悉，像是字串空間要留一格給尾端'\0'； 
  scanf("%s",str)不需要加上&；以及str[0]對應字串中的第一個字元。 
  感覺很類似上課講的矩陣第一格索引為0和矩陣指標的a=&a嗎(?)，總之也試了好幾次才達到我想要的效果，
  但我不知道要怎麼限制讀取的字串大小，所以產生了一個新的問題，
  以輸入密碼為例，我在if裡判斷字串的第五項為'\0' ，所以當我輸入202512345時，會被要求重新輸入， 
  但如果輸入2025 12345的話，一樣能進到選單裡， 
  就這點我不知道要怎麼修改，並且這個程式其他輸入功能都有同樣的問題。*/








